{
  "pitakas": [
    {
      "name": "Vinaya Pitaka",
      "id": "1",
      "description": "The first category, the Vinaya Pitaka, is mostly concerned with the rules of the sangha, both monks and nuns. The rules are preceded by stories telling how the Buddha came to lay them down, and followed by explanations and analysis. According to the stories, the rules were devised on an ad hoc basis as the Buddha encountered various behavioral problems or disputes among his followers.",
      "nikayas": [
        {
          "name": "Suttavibhanga",
          "id": "1.1",
          "description": "Commentary on the Patimokkha, a basic code of rules for monks and nuns that is not as such included in the Canon. The monks' rules are dealt with first, followed by those of the nuns' rules not already covered."
        },
        {
          "name": "Khandhaka",
          "id": "1.2",
          "description": "Other rules grouped by topic in 22 chapters."
        },
        {
          "name": "Parivara",
          "id": "1.3",
          "description": "Analysis of the rules from various points of view."
        }
      ]
    },
    {
      "name": "Sutta Pitaka",
      "description": "The second category is the Sutta Pitaka (literally \"basket of threads\", or of \"the well spoken\"; Sanskrit: Sutra Pitaka, following the former meaning) which consists primarily of accounts of the Buddha's teachings.",
      "nikayas": [
        {
          "name": "Digha Nikaya",
          "id": "2.1",
          "description": "34 long discourses. This book was particularly intended to make converts, with its high proportion of debates and devotional material.",
          "vaggas": [
            {
              "name": "Silakkhandha Vagga",
              "id": "2.1.1",
              "description": "The Division Concerning Morality",
              "suttas": [
                {
                  "name": "Brahmajāla Sutta",
                  "id": "2.1.1.1",
                  "description": "The All-embracing Net of Views. In this important sutta, the first in the Tipitaka, the Buddha describes sixty-two philosophical and speculative views concerning the self and the world that were prevalent among spiritual seekers of his day. In rejecting these teachings — many of which thrive to this day — he decisively establishes the parameters of his own."
                },
                {
                  "name": "Samaññaphala Sutta",
                  "id": "2.1.1.2",
                  "description": "The Fruits of the Contemplative Life. King Ajatasattu asks the Buddha, \"What are the fruits of the contemplative life, visible in the here and now?\" The Buddha replies by painting a comprehensive portrait of the Buddhist path of training, illustrating each stage of the training with vivid similes.",
                  "link": "https://www.accesstoinsight.org/tipitaka/dn/dn.02.0.than.html"
                },
                {
                  "name": "Potthapada Sutta",
                  "id": "2.1.1.9",
                  "description": "The wandering ascetic Potthapada brings to the Buddha a tangle of questions concerning the nature of perception. The Buddha clears up the matter by reviewing the fundamentals of concentration meditation and showing how it can lead to the ultimate cessation of perception.",
                  "link": "https://www.accesstoinsight.org/tipitaka/dn/dn.09.0.than.html"
                },
                {
                  "name": "Kevatta Sutta",
                  "id": "2.1.1.11",
                  "description": "This discourse explores the role of miracles and conversations with heavenly beings as a possible basis for faith and belief. The Buddha does not deny the reality of such experiences, but he points out that — of all possible miracles — the only reliable one is the miracle of instruction in the proper training of the mind. As for heavenly beings, they are subject to greed, anger, and delusion, and so the information they give — especially with regard to the miracle of instruction — is not necessarily trustworthy. Thus the only valid basis for faith is the instruction that, when followed, brings about the end of one's own mental defilements. The tale that concludes the discourse is one of the finest examples of the early Buddhist sense of humor.",
                  "link": "https://www.accesstoinsight.org/tipitaka/dn/dn.11.0.than.html"
                },
                {
                  "name": "Lohicca Sutta",
                  "id": "2.1.1.12",
                  "description": "A non-Buddhist poses some good questions: If Dhamma is something that one must realize for oneself, then what is the role of a teacher? Are there any teachers who don't deserve some sort of criticism? The Buddha's reply includes a sweeping summary of the entire path of practice.",
                  "link": "https://www.accesstoinsight.org/tipitaka/dn/dn.12.0.than.html"
                }
              ],
              "source": "https://www.accesstoinsight.org/tipitaka/dn/index.html"
            },
            {
              "name": "Maha Vagga",
              "id": "2.1.2",
              "description": "The Large Division",
              "suttas": [
                {
                  "name": "Maha Nidana Sutta",
                  "id": "2.1.2.2",
                  "description": "The Great Causes Discourse. One of the most profound discourses in the Pali canon, which gives an extended treatment of the teachings of dependent co-arising (paticca samuppada) and not-self (anatta) in an outlined context of how these teachings function in practice. An explanatory preface is included.",
                  "link": "https://www.accesstoinsight.org/tipitaka/dn/dn.15.0.than.html"
                },
                {
                  "name": "Maha Parinibbana Sutta",
                  "id": "2.1.2.3",
                  "description": "Last Days of the Buddha/The Great Discourse on the Total Unbinding. This wide-ranging sutta, the longest one in the Pali canon, describes the events leading up to, during, and immediately following the death and final release (parinibbana) of the Buddha. This colorful narrative contains a wealth of Dhamma teachings, including the Buddha's final instructions that defined how Buddhism would be lived and practiced long after the Buddha's death — even to this day. But this sutta also depicts, in simple language, the poignant human drama that unfolds among the Buddha's many devoted followers around the time of the death of their beloved teacher.",
                  "link": ""
                },
                {
                  "name": "Maha Samaya Sutta",
                  "id": "2.1.2.7",
                  "description": "The Great Assembly/The Great Meeting. A large group of devas pays a visit to the Buddha. This sutta is the closest thing in the Pali canon to a \"Who's Who\" of the deva worlds, providing useful material for anyone interested in the cosmology of early Buddhism.",
                  "link": ""
                },
                {
                  "name": "Sakka Pañha Sutta",
                  "id": "2.1.2.8",
                  "description": "Sakka's Questions. Sakka, the deva-king, asks the Buddha about the sources of conflict, and about the path of practice that can bring it to an end. This discourse ends with a humorous account about Sakka's frustration in trying to learn the Dhamma from other contemplatives. It's hard to find a teacher when you're a king.",
                  "link": "https://www.accesstoinsight.org/tipitaka/dn/dn.21.2x.than.html"
                },
                {
                  "name": "Maha Satipatta Sutta",
                  "id": "2.1.2.9",
                  "description": "The Great Establishing of Mindfulness Discourse. This sutta sets out the full formula for the practice of establishing mindfulness, and then gives an extensive account of one phrase in the formula: what it means to remain focused on any of the four frames of reference—body, feelings, mind, and mental qualities—in and of itself.",
                  "link": ""
                }
              ],
              "source": "https://www.accesstoinsight.org/tipitaka/dn/index.html"
            },
            {
              "name": "Patika Vagga",
              "id": "2.1.3",
              "description": "The Patika Division",
              "suttas": [
                {
                  "name": "Cakkavatti Sutta",
                  "id": "2.1.3.3",
                  "description": "The Wheel-turning Emperor. In this excerpt the Buddha explains how skillful action can result in the best kind of long life, the best kind of beauty, the best kind of happiness, and the best kind of strength.",
                  "link": "https://www.dhammatalks.org/suttas/DN/DN26.html"
                },
                {
                  "name": "Pāsādika Sutta",
                  "id": "2.1.3.6",
                  "description": "The Inspiring Discourse. Toward the end of his life, the Buddha describes his accomplishment in establishing, through the Dhamma and Vinaya, a complete holy life that will endure after his passing. Listing some of the criticisms that might be leveled against him and his Dhamma-Vinaya, he shows how those criticisms should be refuted. ",
                  "link": "https://www.dhammatalks.org/suttas/DN/DN29.html"
                },
                {
                  "name": "Sigalovada Sutta",
                  "id": "2.1.3.8",
                  "description": "Sigalovada Sutta — The Buddha's Advice to Sigalaka/The Discourse to Sigala. The householder's code of discipline, as described by the Buddha to the layman Sigala. This sutta offers valuable practical advice for householders on how to conduct themselves skillfully in their relationships with parents, spouses, children, pupils, teachers, employers, employees, friends, and spiritual mentors so as to bring happiness to all concerned.",
                  "link": ""
                },
                {
                  "name": "Atanatiya Sutta",
                  "id": "2.1.3.9",
                  "description": "Discourse on Atanatiya. One of the \"protective verses\" (paritta) that are chanted to this day for ceremonial purposes by Theravada monks and nuns around the world. See Piyadassi Thera's The Book of Protection.",
                  "link": "https://www.accesstoinsight.org/tipitaka/dn/dn.32.0.piya.html"
                }
              ],
              "source": "https://www.accesstoinsight.org/tipitaka/dn/index.html"
            }
          ]
        },
        {
          "name": "Majjhima Nikaya",
          "id": "2.2",
          "description": "152 medium-length discourses. This book was particularly intended to give a solid grounding in the teaching to converts, with a high proportion of sermons and consultations."
        },
        {
          "name": "Samyutta Nikaya",
          "id": "2.3",
          "description": "Thousands of short discourses in fifty-odd groups by subject, person etc. This nikaya has the most detailed explanations of doctrine."
        },
        {
          "name": "Anguttara Nikaya",
          "id": "2.4",
          "description": "Thousands of short discourses arranged numerically from ones to elevens. It contains more elementary teaching for ordinary people than the preceding three"
        },
        {
          "name": "Khuddaka Nikaya",
          "id": "2.5",
          "description": "A miscellaneous collection of works in prose or verse"
        }
      ]
    },
    {
      "name": "Abhidhamma Pitaka",
      "id": "3",
      "description": "The third category, the Abhidhamma Pitaka (literally \"beyond the dhamma\", \"higher dhamma\" or \"special dhamma\", Sanskrit: Abhidharma Pitaka), is a collection of texts which give a scholastic explanation of Buddhist doctrines particularly about mind, and sometimes referred to as the \"systematic philosophy\" basket.",
      "nikayas": [
        {
          "name": "Dhammasangani",
          "id": "3.1",
          "description": "Enumeration, definition and classification of dhammas"
        },
        {
          "name": "Vibhanga",
          "id": "3.2",
          "description": "Analysis of 18 topics by various methods, including those of the Dhammasangani"
        },
        {
          "name": "Dhatukatha",
          "id": "3.3",
          "description": "Deals with interrelations between ideas from the previous two books"
        },
        {
          "name": "Puggalapannatti",
          "id": "3.4",
          "description": "Explanations of types of person, arranged numerically in lists from ones to tens"
        },
        {
          "name": "Kathavatthu",
          "id": "3.5",
          "description": "Over 200 debates on points of doctrine"
        },
        {
          "name": "Yamaka",
          "id": "3.6",
          "description": "Applies to 10 topics a procedure involving converse questions (e.g. Is X Y? Is Y X?)"
        },
        {
          "name": "Patthana",
          "id": "3.7",
          "description": "Analysis of 24 types of condition"
        }
      ]
    }
  ],
  "source": "https://en.wikipedia.org/wiki/Pāli_Canon"
}
