{
  "pitakas": [
    {
      "name": "Vinaya Pitaka",
      "id": "1",
      "summary": "The first category, the Vinaya Pitaka, is mostly concerned with the rules of the sangha, both monks and nuns. The rules are preceded by stories telling how the Buddha came to lay them down, and followed by explanations and analysis. According to the stories, the rules were devised on an ad hoc basis as the Buddha encountered various behavioral problems or disputes among his followers.",
      "nikayas": [
        {
          "name": "Suttavibhanga",
          "id": "1.1",
          "summary": "Commentary on the Patimokkha, a basic code of rules for monks and nuns that is not as such included in the Canon. The monks' rules are dealt with first, followed by those of the nuns' rules not already covered."
        },
        {
          "name": "Khandhaka",
          "id": "1.2",
          "summary": "Other rules grouped by topic in 22 chapters."
        },
        {
          "name": "Parivara",
          "id": "1.3",
          "summary": "Analysis of the rules from various points of view."
        }
      ]
    },
    {
      "name": "Sutta Pitaka",
            "id": "2",
      "summary": "The second category is the Sutta Pitaka (literally \"basket of threads\", or of \"the well spoken\"; Sanskrit: Sutra Pitaka, following the former meaning) which consists primarily of accounts of the Buddha's teachings.",
      "nikayas": [
        {
          "name": "Digha Nikaya",
          "id": "2.1",
          "summary": "34 long discourses. This book was particularly intended to make converts, with its high proportion of debates and devotional material.",
          "suttas": [
            {
              "name": "Brahmajāla Sutta",
              "id": "2.1.1",
              "link": "",
              "summary": "In this important sutta, the first in the Tipitaka, the Buddha describes sixty-two philosophical and speculative views concerning the self and the world that were prevalent among spiritual seekers of his day. In rejecting these teachings — many of which thrive to this day — he decisively establishes the parameters of his own.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Samaññaphala Sutta",
              "id": "2.1.2",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/dn.02.0.than.html",
              "summary": "King Ajatasattu asks the Buddha, \"What are the fruits of the contemplative life, visible in the here and now?\" The Buddha replies by painting a comprehensive portrait of the Buddhist path of training, illustrating each stage of the training with vivid similes.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Potthapada Sutta",
              "id": "2.1.9",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/dn.09.0.than.html",
              "summary": "The wandering ascetic Potthapada brings to the Buddha a tangle of questions concerning the nature of perception. The Buddha clears up the matter by reviewing the fundamentals of concentration meditation and showing how it can lead to the ultimate cessation of perception.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Kevatta (Kevaddha) Sutta",
              "id": "2.1.11",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/dn.11.0.than.html",
              "summary": "This discourse explores the role of miracles and conversations with heavenly beings as a possible basis for faith and belief. The Buddha does not deny the reality of such experiences, but he points out that — of all possible miracles — the only reliable one is the miracle of instruction in the proper training of the mind. As for heavenly beings, they are subject to greed, anger, and delusion, and so the information they give — especially with regard to the miracle of instruction — is not necessarily trustworthy. Thus the only valid basis for faith is the instruction that, when followed, brings about the end of one's own mental defilements. The tale that concludes the discourse is one of the finest examples of the early Buddhist sense of humor. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Lohicca Sutta",
              "id": "2.1.12",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/dn.12.0.than.html",
              "summary": "A non-Buddhist poses some good questions: If Dhamma is something that one must realize for oneself, then what is the role of a teacher? Are there any teachers who don't deserve some sort of criticism? The Buddha's reply includes a sweeping summary of the entire path of practice.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-nidana Sutta",
              "id": "2.1.15",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/dn.15.0.than.html",
              "summary": "One of the most profound discourses in the Pali canon, which gives an extended treatment of the teachings of dependent co-arising (paticca samuppada) and not-self (anatta) in an outlined context of how these teachings function in practice. An explanatory preface is included.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-parinibbana Sutta",
              "id": "2.1.16",
              "link": "",
              "summary": "This wide-ranging sutta, the longest one in the Pali canon, describes the events leading up to, during, and immediately following the death and final release (parinibbana) of the Buddha. This colorful narrative contains a wealth of Dhamma teachings, including the Buddha's final instructions that defined how Buddhism would be lived and practiced long after the Buddha's death — even to this day. But this sutta also depicts, in simple language, the poignant human drama that unfolds among the Buddha's many devoted followers around the time of the death of their beloved teacher.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-samaya Sutta",
              "id": "2.1.20",
              "link": "",
              "summary": "A large group of devas pays a visit to the Buddha. This sutta is the closest thing in the Pali canon to a \"Who's Who\" of the deva worlds, providing useful material for anyone interested in the cosmology of early Buddhism.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Sakka-pañha Sutta",
              "id": "2.1.21",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/dn.21.2x.than.html",
              "summary": "Sakka, the deva-king, asks the Buddha about the sources of conflict, and about the path of practice that can bring it to an end. This discourse ends with a humorous account about Sakka's frustration in trying to learn the Dhamma from other contemplatives. It's hard to find a teacher when you're a king.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": " Maha-satipatthana Sutta",
              "id": "2.1.22",
              "link": "",
              "summary": "This sutta sets out the full formula for the practice of establishing mindfulness, and then gives an extensive account of one phrase in the formula: what it means to remain focused on any of the four frames of reference—body, feelings, mind, and mental qualities—in and of itself. [The text of this sutta is identical to that of the Satipatthana Sutta (MN 10), except that the Majjhima version omits the exposition of the Four Noble Truths (sections 5a,b,c and d in part D of this version).] [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": " Cakkavatti Sutta",
              "id": "2.1.26",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tps://www.dhammatalks.org/suttas/DN/DN26.html",
              "summary": "In this excerpt the Buddha explains how skillful action can result in the best kind of long life, the best kind of beauty, the best kind of happiness, and the best kind of strength.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": " Pāsādika Sutta",
              "id": "2.1.29",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tps://www.dhammatalks.org/suttas/DN/DN29.html",
              "summary": "Toward the end of his life, the Buddha describes his accomplishment in establishing, through the Dhamma and Vinaya, a complete holy life that will endure after his passing. Listing some of the criticisms that might be leveled against him and his Dhamma-Vinaya, he shows how those criticisms should be refuted. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Sigalovada Sutta",
              "id": "2.1.31",
              "link": "",
              "summary": "The householder's code of discipline, as described by the Buddha to the layman Sigala. This sutta offers valuable practical advice for householders on how to conduct themselves skillfully in their relationships with parents, spouses, children, pupils, teachers, employers, employees, friends, and spiritual mentors so as to bring happiness to all concerned.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Atanatiya Sutta",
              "id": "2.1.32",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/dn.32.0.piya.html",
              "summary": "One of the \"protective verses\" (paritta) that are chanted to this day for ceremonial purposes by Theravada monks and nuns around the world. See Piyadassi Thera's The Book of Protection.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            }
          ]
        },
        {
          "name": "Majjhima Nikaya",
          "id": "2.2",
          "summary": "152 medium-length discourses. This book was particularly intended to give a solid grounding in the teaching to converts, with a high proportion of sermons and consultations.",
          "suttas": [
            {
              "name": "Mulapariyaya Sutta",
              "id": "2.2.1",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.001.than.html",
              "summary": "In this difficult but important sutta the Buddha reviews in depth one of the most fundamental principles of Buddhist thought and practice: namely, that there is no thing — not even Nibbana itself — that can rightly be regarded as the source from which all phenomena and experience emerge.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Sabbasava Sutta",
              "id": "2.2.2",
              "link": "",
              "summary": "The Buddha teaches seven methods for eliminating from the mind the deeply rooted defilements (sensuality, becoming, views, and ignorance) that obstruct the realization of Awakening.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Bhaya-bherava Sutta",
              "id": "2.2.4",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.004.than.html",
              "summary": "What would it take to live in solitude in the wilderness, completely free of fear? The Buddha explains.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Anaṅgaṇa Sutta",
              "id": "2.2.5",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tps://dhammatalks.org/suttas/MN/MN5.html",
              "summary": "Ven. Sāriputta explains the blemishes of the mind: the influences of evil, unskillful wishes. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Ākaṅkheyya Sutta",
              "id": "2.2.6",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tps://dhammatalks.org/suttas/MN/MN6.html",
              "summary": "The wishes that can be fulfilled by brining the precepts to perfection, being committed to inner tranquility of awareness, not neglecting jhāna, being endowed with insight, and frequenting empty dwellings. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Vatthupama Sutta",
              "id": "2.2.7",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.007.nypo.html",
              "summary": "With a simple simile the Buddha illustrates the difference between a defiled mind and a pure mind. [BB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Sallekha Sutta",
              "id": "2.2.8",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.008.nypo.html",
              "summary": "The Buddha explains how unskillful qualities in the heart can be eradicated through meditation.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Sammaditthi Sutta",
              "id": "2.2.9",
              "link": "",
              "summary": "How the four noble truths, dependent co-arising, and the knowledge that ends mental fermentation all build upon the basic dichotomy between skillful and unskillful action.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Satipatthana Sutta",
              "id": "2.2.10",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tp://www.suttareadings.net/audio/index.html#mn.010",
              "summary": "This sutta sets out the full formula for the practice of establishing mindfulness, and then gives an extensive account of one phrase in the formula: what it means to remain focused on any of the four frames of reference—body, feelings, mind, and mental qualities—in and of itself. [TB] [The text of this sutta is identical to that of the Maha-satipatthana Sutta (DN 22), but without its detailed exposition of the Four Noble Truths (sections 5a,b,c and d in part D of that version).]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula-sihanada Sutta",
              "id": "2.2.11",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.011.ntbb.html",
              "summary": "The Buddha declares that only through practicing in accord with the Dhamma can Awakening be realized. His teaching is distinguished from those of other religions and philosophies through its unique rejection of all doctrines of self. [BB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-sihanada Sutta",
              "id": "2.2.12",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.012.ntbb.html",
              "summary": "The Buddha expounds the ten powers of a Tathagata, his four kinds of intrepidity, and other superior qualities which entitle him to \"roar his lion's roar in the assemblies.\" [BB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-dukkhakkhandha Sutta",
              "id": "2.2.13",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.013.than.html",
              "summary": "In deliciously graphic terms, the Buddha describes the allures and drawbacks of sensuality, physical form, and feeling. What better incentive could there be to escape samsara once and for all?",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula-dukkhakkhandha Sutta",
              "id": "2.2.14",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.014.than.html",
              "summary": "What mental qualities must be abandoned in order to free oneself of greed, aversion, and delusion? Can painful austerities be used to purify oneself and burn away the karmic fruit of past misdeeds? Through  question-and-answer dialogues with the lay follower Mahanama and with a group of Jain ascetics, the Buddha lays these questions to rest.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Madhupindika Sutta",
              "id": "2.2.18",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.018.than.html",
              "summary": "A man looking to pick a fight asks the Buddha to explain his doctrine. The Buddha's answer mystifies not only the man, but also a number of monks. Ven. Maha Kaccana finally provides an explanation, and in the course of doing so explains what is needed to bring the psychological sources of conflict to an end.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Dvedhavitakka Sutta",
              "id": "2.2.19",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.019.than.html",
              "summary": "The Buddha recounts the events leading up to his Awakening, and describes his discovery that thoughts connected with sensuality, ill-will, and harmfulness do not lead one to Awakening, while those connected with their opposites (renunciation, non ill-will, and harmlessness) do.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Vitakkasanthana Sutta",
              "id": "2.2.20",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tp://www.suttareadings.net/audio/index.html#mn.020",
              "summary": "The Buddha offers five practical methods of responding wisely to unskillful thoughts (thoughts connected with desire, aversion, or delusion).",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Kakacupama Sutta",
              "id": "2.2.21",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tp://www.suttareadings.net/audio/index.html#mn.021",
              "summary": "The Buddha tells the story of a wise slave who deliberately tests her mistress's patience. The Buddha invokes several memorable similes here to illustrate the correct way to develop patience.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Alagaddupama Sutta",
              "id": "2.2.22",
              "link": "",
              "summary": "Using two famous similes, the Buddha shows how the development of right view calls for the skillful application both of grasping and of letting-go. The sutta includes one of the Canon's most important expositions on the topic of not-self.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Ratha-vinita Sutta",
              "id": "2.2.24",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.024.than.html",
              "summary": "Using the simile of a set of relay chariots, Ven. Punna Mantaniputta explains the relationship of the factors of the path to the goal of the holy life. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Ariyapariyesana Sutta",
              "id": "2.2.26",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.026.than.html",
              "summary": "Most of us spend a good part of our lives looking for happiness in all the wrong places. In this sutta the Buddha recounts the story of his own search and points out where a true and lasting happiness can be found.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula-hatthipadopama Sutta",
              "id": "2.2.27",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.027.than.html",
              "summary": "At what point do you know for sure that the Buddha's awakening was genuine? [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-hatthipadopama Sutta",
              "id": "2.2.28",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.028.than.html",
              "summary": "An explanation of the four noble truths, focusing on the aggregate of physical form and showing (1) how all the aggregates are interrelated and (2) how all four noble truths, together with the principle of dependent co-arising, are related to the aggregates. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha Saropama Sutta",
              "id": "2.2.29",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.029.than.html",
              "summary": "The Buddha compares the rewards of the practice to different parts of a large tree, with total release the most valuable part of the tree: the heartwood. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula Saropama Sutta",
              "id": "2.2.30",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.030.than.html",
              "summary": "The Buddha compares the rewards of the practice to different parts of a large tree, with total release the most valuable part of the tree: the heartwood. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-gopalaka Sutta",
              "id": "2.2.33",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.033.than.html",
              "summary": "Eleven factors that are conducive to spiritual growth, and eleven that are obstructive. (Apart from the preamble, this sutta is identical to AN 11.18.)",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Culagopalika Sutta",
              "id": "2.2.34",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.034x.olen.html",
              "summary": "In this brief excerpt the Buddha urges his monks to cross over to the lasting safety of Nibbana.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula-Saccaka Sutta",
              "id": "2.2.35",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.035.than.html",
              "summary": "Even though the Buddha did not usually seek debates, he knew how to reply effectively when attacked. In this discourse, he gets Saccaka — who uses a variety of cheap debater's tricks — to trip over those tricks. However, the Buddha goes beyond simply defeating Saccaka in debate. He then takes the opportunity to teach him the Dhamma. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-Saccaka Sutta",
              "id": "2.2.36",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.036.than.html",
              "summary": "In response to an insinuating remark — that his ability not to be overcome by pleasure and pain is due simply to the fact that he never experienced any intense pleasures or pains — the Buddha recounts the pains he endured in his austerities, and the pleasures that attended the path to and his attainment of Awakening.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Mahatanhasankhaya Sutta",
              "id": "2.2.38",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.038.than.html",
              "summary": "A long discourse in which the Buddha discusses how to understand the role of consciousness — as a process — in the process of birth in a way that actually can lead to the end of birth.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-Assapura Sutta",
              "id": "2.2.39",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.039.than.html",
              "summary": "The Buddha outlines the full course of training by which a meditator may earn the right to call him- or herself a true contemplative. As presented here, the training begins with conscience and concern for the results of one's actions, and leads progressively through the cultivation of virtue, sense-restraint, moderation, wakefulness, mindfulness, alertness, the four jhanas, finally culminating in the realization of the insight knowledges.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Saleyyaka Sutta",
              "id": "2.2.41",
              "link": "",
              "summary": "A discussion of ten types of skillful and unskillful conduct in body, speech, and mind, and of the future rewards open to those who follow the guidelines to skillful conduct. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Mahavedalla Sutta",
              "id": "2.2.43",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.043.than.html",
              "summary": "Ven. Sariputta answers questions dealing with discernment, right view, and the higher meditative attainments.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Culavedalla Sutta",
              "id": "2.2.44",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.044.than.html",
              "summary": "Dhammadinna the nun fields a series of Dhamma questions put to her by her former husband: questions on self-identification, cessation, penetration into the true nature of feeling, and the attainment of Nibbana.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula-dhammasamadana Sutta",
              "id": "2.2.45",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.045.than.html",
              "summary": "Is something right because it feels right? [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Kosambiyā Sutta",
              "id": "2.2.48",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tps://dhammatalks.org/suttas/MN/MN48.html",
              "summary": "Teaching a group of monks who have been quarreling over a minor matter, the Buddha outlines the causes for harmony in a group and reminds the monks of the purpose of their training: the right ending of suffering and stress. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Brahma-nimantanika Sutta",
              "id": "2.2.49",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.049.than.html",
              "summary": "The Buddha disarms two powerful antagonists through his profound understanding of the nature of consciousness.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Atthakanagara Sutta",
              "id": "2.2.52",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.052.than.html",
              "summary": "Ven. Ananda describes eleven modes of practice that can lead to the Deathless. (Apart from the preamble, this sutta is identical to AN 11.17.)",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Sekha-patipada Sutta",
              "id": "2.2.53",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.053.than.html",
              "summary": "\"Consummate in clear-knowing and conduct\" is a standard epithet for the Buddha. This sutta explains what it means, and shows that it can be used to describe an arahant as well. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Potaliya Sutta",
              "id": "2.2.54",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.054x.than.html",
              "summary": "Using seven graphic similes for the drawbacks of sensual passions, the Buddha teaches Potaliya the householder what it means, in the discipline of a noble one, to have entirely cut off one's worldly affairs. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Kukkuravatika Sutta",
              "id": "2.2.57",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.057.nymo.html",
              "summary": "Act like a dog, and that's what you'll become. The moral: choose your actions with care.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Abhaya Sutta",
              "id": "2.2.58",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tp://www.suttareadings.net/audio/index.html#mn.058",
              "summary": "The Buddha explains the criteria for determining whether or not something is worth saying. This discourse is a beautiful example of the Buddha's skill as teacher: not only does he talk about right speech, but he also demonstrates right speech in action.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Bahuvedaniya Sutta",
              "id": "2.2.59",
              "link": "",
              "summary": "The Buddha discusses the range of possible pleasures and joys, and concludes by advocating a pleasure that goes beyond feeling. [The text of this sutta is almost identical to that of SN 36.19.]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Apannaka  Sutta",
              "id": "2.2.60",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.060.than.html",
              "summary": "The Buddha explains to a group of householders how to navigate skillfully through the maze of wrong views.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Ambalatthika-rahulovada Sutta",
              "id": "2.2.61",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tp://www.suttareadings.net/audio/index.html#mn.061",
              "summary": "The Buddha admonishes his son, the novice Rahula, on the dangers of lying and stresses the importance of constant reflection on one's motives. (This is one of the suttas selected by King Asoka (r. 270-232 BCE) to be studied and reflected upon frequently by all practicing Buddhists. See That the True Dhamma Might Last a Long Time: Readings Selected by King Asoka, by Thanissaro Bhikkhu.)",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-Rahulovada Sutta",
              "id": "2.2.62",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.062.than.html",
              "summary": "The Buddha delivers meditation instructions to his son, the novice Rahula.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula-Malunkyovada Sutta",
              "id": "2.2.63",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.063.than.html",
              "summary": "Ven. Malunkyaputta threatens to disrobe unless the Buddha answers all his speculative metaphysical questions. Using the famous simile of a man shot by a poison arrow, the Buddha reminds him that some questions are simply not worth asking.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Latukikopama Sutta",
              "id": "2.2.66",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.066.than.html",
              "summary": "Fetters are strong, not because of their own tensile strength, but because of the tenacity of our unwillingness to let them go. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Kitagiri Sutta",
              "id": "2.2.70",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.070.than.html",
              "summary": "A discourse on the importance of conviction in the Buddhist path. Not only is conviction a prerequisite for listening to the Buddha's teachings with respect, but — as is shown by the unusual discussion here categorizing the types of noble disciples — it can underlie the practice all the way to the Deathless. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Aggi-Vacchagotta Sutta",
              "id": "2.2.72",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.072.than.html",
              "summary": "The Buddha explains to a wanderer why he does not hold any speculative views. Using the simile of an extinguished fire he illustrates the destiny of the liberated being. [BB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Dighanaka Sutta",
              "id": "2.2.74",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.074.than.html",
              "summary": "A discussion of how to abandon doctrinaire views of radical acceptance, radical rejection, and any combination of the two. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Magandiya Sutta",
              "id": "2.2.75",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.075x.than.html",
              "summary": "In this passage, the Buddha teaches a member of a hedonist sect about the nature of true pleasure and true health. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Samana-Mundika Sutta",
              "id": "2.2.78",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.078.than.html",
              "summary": "The highest attainment is not simply the abandoning of unskillful actions and a reversion to childlike harmlessness. It requires first developing skillful habits and skillful resolves, and then letting them go. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Ratthapala Sutta",
              "id": "2.2.82",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.082.than.html",
              "summary": "A two-part story about the monk who, the Buddha said, was foremost among his disciples in ordaining on the power of pure conviction. In the first part of the story, Ratthapala deals with his parents' opposition to his ordaining, and their attempts, after ordination, to lure him back to lay life. In the second part, he recalls the four observations about the world that inspired him, as a healthy and wealthy young man, to ordain in the first place.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Angulimala Sutta",
              "id": "2.2.86",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.086.than.html",
              "summary": "A murderous bandit takes refuge in the Buddha, develops a heart of compassion, and becomes an arahant. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Piyajatika Sutta",
              "id": "2.2.87",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.087.than.html",
              "summary": "King Pasenadi of Kosala figures prominently in many discourses as a devout follower of the Buddha. In this discourse we learn how — thanks to Queen Mallika's astuteness — the king first became favorably disposed toward the Buddha. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Kannakatthala Sutta",
              "id": "2.2.90",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.090.than.html",
              "summary": "A case study in how social advantages can be a spiritual liability. The discussion focuses on the factors needed for release — attainable by all people, regardless of caste or race — while the gently satirical frame story shows how the life of a king, or any highly placed person, presents obstacles to developing those factors. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Assalayana Sutta",
              "id": "2.2.93",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.093.than.html",
              "summary": "The Buddha enters into a debate with a brahman on whether one's worth as a person is determined by birth or by behavior. Although some of the arguments he presents here deal with the specifics of brahman caste pride, many of them are applicable to issues of racism and nationalism in general. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Canki Sutta",
              "id": "2.2.95",
              "link": "",
              "summary": "A pompous brahman teenager questions the Buddha about safeguarding, awakening to, and attaining the truth. In the course of his answer, the Buddha describes the criteria for choosing a reliable teacher and how best to learn from such a person. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Dhanañjani Sutta",
              "id": "2.2.97",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.097.than.html",
              "summary": "A poignant story of a lay person whose welfare was of special concern to Ven. Sariputta, this discourse teaches two lessons in heedfulness. (1) If you're engaging in wrong livelihood, don't expect to escape the karmic consequences even if you're doing it to fulfil your duties to your family, parents, or friends. (2) Don't be satisfied with mundane levels of attainment in meditation when there is still more to be done. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Devadaha Sutta",
              "id": "2.2.101",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.101.than.html",
              "summary": "The Buddha refutes a Jain theory of kamma, which claims that one's present experience is determined solely by one's actions in past lives, and that the effects of past unskillful actions can be \"burned away\" through austerity practices. The Buddha here outlines one of his most important teachings on kamma: that it is both the results of past deeds and present actions that shape one's experience of the present. It is precisely this interaction of present and past that opens up the very possibility of Awakening.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Pañcattaya Sutta",
              "id": "2.2.102",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tps://dhammatalks.org/suttas/MN/MN102.html",
              "summary": "This excerpt discusses views that can get in the way of awakening. Some of the views are speculative, whereas as the most subtle obstructions come from overestimating your meditation attainment. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Sunakkhatta Sutta",
              "id": "2.2.105",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.105.than.html",
              "summary": "The Buddha addresses the problem of meditators who overestimate their progress in meditation. The sutta ends with a warning: anyone who claims enlightenment as license for unrestrained behavior is like someone who fails to follow the doctor's orders after surgery, who knowingly drinks a cup of poison, or who deliberately extends a hand toward a deadly snake. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Aneñja-sappaya Sutta",
              "id": "2.2.106",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.106.than.html",
              "summary": "Advanced meditation instruction: how the fourth jhana and the formless attainments can be developed and used as a basis for the realization of Nibbana.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Ganakamoggallana Sutta",
              "id": "2.2.107",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.107.horn.html",
              "summary": "The Buddha sets forth the gradual training of the Buddhist monk and describes himself as a \"shower of the way.\" [BB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Gopaka Moggallana Sutta",
              "id": "2.2.108",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.108.than.html",
              "summary": "Ven. Ananda explains how the Sangha maintains its unity and internal discipline after the passing away of the Buddha [BB]. Interestingly, this sutta also shows that early Buddhist practice had no room for many practices that developed in later Buddhist traditions, such as appointed lineage holders, elected ecclesiastical heads, or the use of mental defilements as a basis for concentration practice. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-punnama Sutta",
              "id": "2.2.109",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.109.than.html",
              "summary": "A thorough discussion of issues related to the five aggregates. Toward the end of the discussion, a monk thinks that he has found a loophole in the teaching. The way the Buddha handles this incident shows the proper use of the teachings on the aggregates: not as a metaphysical theory, but as a tool for questioning clinging and so gaining release. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula-punnama Sutta",
              "id": "2.2.110",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.110.than.html",
              "summary": "How to recognize — and become — a person of integrity.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Anupada Sutta",
              "id": "2.2.111",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.111.than.html",
              "summary": "A description of how insight can be developed either while in, or immediately after withdrawing from, the different levels of jhana.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Sappurisa Sutta",
              "id": "2.2.113",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.113.than.html",
              "summary": "What is a person of integrity?",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Isigili Sutta",
              "id": "2.2.116",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.116.piya.html",
              "summary": "The Buddha enumerates the many paccekabuddhas who lived on Isigili mountain.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-cattarisaka Sutta",
              "id": "2.2.117",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.117.than.html",
              "summary": "On the nature of noble right concentration, and its interdependence with all the factors of the noble eightfold path.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Anapanasati Sutta",
              "id": "2.2.118",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.118.than.html",
              "summary": "One of the most important texts for beginning and veteran meditators alike, this sutta is the Buddha's roadmap to the entire course of meditation practice, using the vehicle of breath meditation. The simple practice of mindfulness of breathing leads the practitioner gradually through 16 successive phases of development, culminating in full Awakening.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Kayagata-sati Sutta",
              "id": "2.2.119",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.119.than.html",
              "summary": "This sutta serves as a companion to the Anapanasati Sutta, and explains the importance of establishing a broad awareness of the body in meditation to develop jhana.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula-suññata Sutta",
              "id": "2.2.121",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.121.than.html",
              "summary": "The Buddha instructs Ven. Ananda on the practice that leads to the \"entry into emptiness,\" the doorway to liberation. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-suññata Sutta",
              "id": "2.2.122",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.122.than.html",
              "summary": "The Buddha instructs Ananda on several practical aspects of the meditative dwelling in emptiness, a mode of awareness that can ultimately bring the meditator to the threshold of Awakening.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Acchariy’abbhūtadhamma Sutta",
              "id": "2.2.123",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tps://dhammatalks.org/suttas/MN/MN123.html",
              "summary": "A miraculous account of the Buddha’s birth.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Dantabhumi Sutta",
              "id": "2.2.125",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.125.horn.html",
              "summary": "By analogy with the taming of an elephant, the Buddha explains how he tames his disciples. [BB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Bhumija Sutta",
              "id": "2.2.126",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.126.than.html",
              "summary": "Does the desire for Awakening get in the way of Awakening? According to this discourse, the question of desiring or not desiring is irrelevant as long as one develops the appropriate qualities that constitute the path to Awakening. The discourse is also very clear on the point that there are right and wrong paths of practice: as a geographer might say, not every river flows to the sea. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Devaduta Sutta",
              "id": "2.2.130",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.130.than.html",
              "summary": "The Buddha's eyewitness account of hell.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Bhaddekaratta Sutta",
              "id": "2.2.131",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tp://www.suttareadings.net/audio/index.html#mn.131",
              "summary": "In this stirring discourse the Buddha underscores the vital urgency of keeping one's attention firmly rooted in the present moment. After all, the past is gone, the future isn't here; this present moment is all we have.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula-kammavibhanga Sutta",
              "id": "2.2.135",
              "link": "",
              "summary": "Why do some people live a long life, but others die young? Why are some people born poor, but others born rich? The Buddha explains how kamma accounts for a person's fortune or misfortune.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha Kammavibhanga Sutta",
              "id": "2.2.136",
              "link": "",
              "summary": "Two lessons in the dangers of quick generalization. In the first, the Buddha points out that the perception of all feeling as stressful is not appropriate at all stages of the practice. In the second, he shows that generalizing too quickly on the basis of what one sees in meditation can lead to serious wrong view. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Salayatana-vibhanga Sutta",
              "id": "2.2.137",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.137.than.html",
              "summary": "A discussion of the emotions: where they come from, how they function in the path of practice, and how they manifest in an awakened person who is fit to teach others. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Uddesa-vibhanga Sutta",
              "id": "2.2.138",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.138.than.html",
              "summary": "How to attend to outside objects without letting the mind become externally scattered, and how to focus in strong states of absorption without becoming internally positioned. It's not easy, but it can be done. [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Dhatu-vibhanga Sutta",
              "id": "2.2.140",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.140.than.html",
              "summary": "A poignant story in which a wanderer, searching for the Buddha, meets the Buddha without realizing it. He recognizes his mistake only after the Buddha teaches him a profound discourse on four determinations and the six properties of experience. An excellent illustration of the Buddha's statement, \"Whoever sees the Dhamma sees me.\" [TB]",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Saccavibhanga Sutta",
              "id": "2.2.141",
              "link": "",
              "summary": "Ven. Sariputta gives a detailed elaboration on the Buddha's teaching of the Four Noble Truths.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Anathapindikovada Sutta",
              "id": "2.2.143",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/tp://www.suttareadings.net/audio/index.html#mn.143",
              "summary": "Ven. Sariputta offers a deep teaching on non-clinging to the ailing lay-follower Anathapindika.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Nandakovada Sutta",
              "id": "2.2.146",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.146.than.html",
              "summary": "Ven. Nandaka discusses impermanence with a large group of nuns, driving his point home with particularly vivid similes. It was an effective teaching: soon afterwards, these nuns all become enlightened.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Cula-Rahulovada Sutta",
              "id": "2.2.147",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.147.than.html",
              "summary": "The Buddha leads his son, Ven. Rahula, to arahantship.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Chachakka Sutta",
              "id": "2.2.148",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.148.than.html",
              "summary": "How the contemplation of the six senses leads to an understanding of not-self and, ultimately, to Awakening.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Maha-salayatanika Sutta",
              "id": "2.2.149",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.149.than.html",
              "summary": "How a clear understanding of the six senses leads to the development of the Wings to Awakening and to final release.",
              "source": "https://www.accesstoinsight.org/tipitaka"
            },
            {
              "name": "Indriya-bhavana Sutta",
              "id": "2.2.152",
              "link": "https://www.accesstoinsight.org/tipitaka/mn/mn.152.than.html",
              "summary": "What qualifies as full mastery of the senses?",
              "source": "https://www.accesstoinsight.org/tipitaka"
            }
          ]
        },
        {
          "name": "Samyutta Nikaya",
          "id": "2.3",
          "summary": "Thousands of short discourses in fifty-odd groups by subject, person etc. This nikaya has the most detailed explanations of doctrine."
        },
        {
          "name": "Anguttara Nikaya",
          "id": "2.4",
          "summary": "Thousands of short discourses arranged numerically from ones to elevens. It contains more elementary teaching for ordinary people than the preceding three"
        },
        {
          "name": "Khuddaka Nikaya",
          "id": "2.5",
          "summary": "A miscellaneous collection of works in prose or verse"
        }
      ]
    },
    {
      "name": "Abhidhamma Pitaka",
      "id": "3",
      "summary": "The third category, the Abhidhamma Pitaka (literally \"beyond the dhamma\", \"higher dhamma\" or \"special dhamma\", Sanskrit: Abhidharma Pitaka), is a collection of texts which give a scholastic explanation of Buddhist doctrines particularly about mind, and sometimes referred to as the \"systematic philosophy\" basket.",
      "nikayas": [
        {
          "name": "Dhammasangani",
          "id": "3.1",
          "summary": "Enumeration, definition and classification of dhammas"
        },
        {
          "name": "Vibhanga",
          "id": "3.2",
          "summary": "Analysis of 18 topics by various methods, including those of the Dhammasangani"
        },
        {
          "name": "Dhatukatha",
          "id": "3.3",
          "summary": "Deals with interrelations between ideas from the previous two books"
        },
        {
          "name": "Puggalapannatti",
          "id": "3.4",
          "summary": "Explanations of types of person, arranged numerically in lists from ones to tens"
        },
        {
          "name": "Kathavatthu",
          "id": "3.5",
          "summary": "Over 200 debates on points of doctrine"
        },
        {
          "name": "Yamaka",
          "id": "3.6",
          "summary": "Applies to 10 topics a procedure involving converse questions (e.g. Is X Y? Is Y X?)"
        },
        {
          "name": "Patthana",
          "id": "3.7",
          "summary": "Analysis of 24 types of condition"
        }
      ]
    }
  ],
  "source": "https://en.wikipedia.org/wiki/Pāli_Canon"
}
