{
  "author": "Thanissaro Bhikkhu",
  "preface_lines": [],
  "chapter_lines": [
    {
      "tag": "p",
      "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Now, on that occasion Ven. Sariputta was wandering in the Southern Mountains with a large community of monks. Then a certain monk who had spent the Rains in Rajagaha went to the Southern Mountains, to Ven. Sariputta. On arrival, he exchanged courteous greetings with Ven. Sariputta and — after an exchange of friendly greetings & courtesies — sat to one side. As he was sitting there, Ven. Sariputta said to him, \"I trust, friend, that the Blessed One is strong & free from illness?\""
    },
    {
      "tag": "p",
      "text": "\"The Blessed One, friend, is strong & free from illness.\""
    },
    {
      "tag": "p",
      "text": "\"I trust that the community of monks is strong & free from illness?\""
    },
    {
      "tag": "p",
      "text": "\"The community of monks is also strong & free from illness.\""
    },
    {
      "tag": "p",
      "text": "\"At the Tandulapala Gate is a brahman named Dhanañjanin.[1] I trust that he is strong & free from illness?\""
    },
    {
      "tag": "p",
      "text": "\"Dhanañjanin the brahman is also strong & free from illness.\""
    },
    {
      "tag": "p",
      "text": "\"And I trust that Dhanañjanin the brahman is heedful?\""
    },
    {
      "tag": "p",
      "text": "\"From where would our Dhanañjanin the brahman get any heedfulness, friend? Relying on the king, he plunders brahmans & householders. Relying on the brahmans & householders, he plunders the king. His wife — a woman of faith, fetched from a family with faith — has died. He has fetched another wife — a woman of no faith — from a family with no faith.\""
    },
    {
      "tag": "p",
      "text": "\"What a bad thing to hear, my friend — when we hear that Dhanañjanin the brahman is heedless. Perhaps sooner or later we might meet with Dhanañjanin the brahman. Perhaps there might be some conversation.\""
    },
    {
      "tag": "p",
      "text": "Then Ven. Sariputta, having stayed in the Southern Mountains as long as he liked, wandered in the direction of Rajagaha. After wandering by stages, he arrived at Rajagaha. There he stayed near Rajagaha in the Squirrels' Sanctuary."
    },
    {
      "tag": "p",
      "text": "Then early in the morning, Ven. Sariputta put on his robes and, carrying his bowl & outer robe, went into Rajagaha for alms. And on that occasion Dhanañjanin the brahman was milking cows in a cow pen outside the city. Then Ven. Sariputta, having gone for alms in Rajagaha, after his meal, on his way back from his almsround, went to Dhanañjanin the brahman. Dhanañjanin the brahman saw Ven. Sariputta coming from afar. On seeing him, he went to him and said, \"Drink some of this fresh milk, master Sariputta. It must be time for your meal.\""
    },
    {
      "tag": "p",
      "text": "\"That's all right, brahman. I have finished my meal for today. My day's abiding will be under that tree over there. You may come there.\""
    },
    {
      "tag": "p",
      "text": "\"As you say, master,\" Dhanañjanin responded to Ven. Sariputta. Then after he had finished his morning meal, he went to Ven. Sariputta. On arrival, he exchanged courteous greetings with Ven. Sariputta and — after an exchange of friendly greetings & courtesies — sat to one side. As he was sitting there, Ven. Sariputta said to him, \"I trust, Dhanañjanin, that you are heedful?\""
    },
    {
      "tag": "p",
      "text": "\"From where would we get any heedfulness, master? — when parents are to be supported, wife & children are to be supported, slaves & workers are to be supported, friend-&-companion duties are to be done for friends & companions, kinsmen-&-relative duties for kinsmen & relatives, guest duties for guests, departed-ancestor duties for departed ancestors, devata duties for devatas, king duties for the king, and this body also has to be refreshed & nourished.\""
    },
    {
      "tag": "p",
      "text": "\"What do you think, Dhanañjanin? There is the case where a certain person, for the sake of his mother & father, does what is unrighteous, does what is discordant. Then, because of his unrighteous, discordant behavior, hell-wardens drag him off to hell. Would he gain anything by saying, 'I did what is unrighteous, what is discordant, for the sake of my mother & father. Don't [throw] me into hell, hell-wardens!' Or would his mother & father gain anything for him by saying, 'He did what is unrighteous, what is discordant, for our sake. Don't [throw] him into hell, hell-wardens!'?\""
    },
    {
      "tag": "p",
      "text": "\"No, master Sariputta. Even right while he was wailing, they'd cast him into hell.\""
    },
    {
      "tag": "p",
      "text": "\"What do you think, Dhanañjanin? There is the case where a certain person, for the sake of his wife & children ... his slaves & workers ... his friends & companions ... his kinsmen & relatives ... his guests ... his departed ancestors ... the devatas ... the king, does what is unrighteous, does what is discordant. Then, because of his unrighteous, discordant behavior, hell-wardens drag him off to hell. Would he gain anything by saying, 'I did what is unrighteous, what is discordant, for the sake of the king. Don't [throw] me into hell, hell-wardens!' Or would the king gain anything for him by saying, 'He did what is unrighteous, what is discordant, for our sake. Don't [throw] him into hell, hell-wardens!'?\""
    },
    {
      "tag": "p",
      "text": "\"No, master Sariputta. Even right while he was wailing, they'd cast him into hell.\""
    },
    {
      "tag": "p",
      "text": "\"What do you think, Dhanañjanin? There is the case where a certain person, for the sake of refreshing & nourishing his body, does what is unrighteous, does what is discordant. Then, because of his unrighteous, discordant behavior, hell-wardens drag him off to hell. Would he gain anything by saying, 'I did what is unrighteous, what is discordant, for the sake of refreshing & nourishing my body. Don't [throw] me into hell, hell-wardens!' Or would others gain anything for him by saying, 'He did what is unrighteous, what is discordant, for the sake of refreshing & nourishing his body. Don't [throw] him into hell, hell-wardens!'?\""
    },
    {
      "tag": "p",
      "text": "\"No, master Sariputta. Even right while he was wailing, they'd cast him into hell.\""
    },
    {
      "tag": "p",
      "text": "\"Now, what do you think, Dhanañjanin? Which is the better: one who, for the sake of his mother & father, would do what is unrighteous, what is discordant; or one who, for the sake of his mother & father, would do what is righteous, what is concordant?"
    },
    {
      "tag": "p",
      "text": "\"Master Sariputta, the one who, for the sake of his mother & father, would do what is unrighteous, what is discordant, is not the better one. The one who, for the sake of his mother & father, would do what is righteous, what is concordant would be the better one there. Righteous behavior, concordant behavior, is better than unrighteous behavior, discordant behavior.[2]"
    },
    {
      "tag": "p",
      "text": "\"Dhanañjanin, there are other activities — reasonable, righteous — by which one can support one's mother & father, and at the same time both not do evil and practice the practice of merit."
    },
    {
      "tag": "p",
      "text": "\"What do you think, Dhanañjanin: Which is the better: one who, for the sake of his wife & children ... his slaves & workers ... his friends & companions ... his kinsmen & relatives ... his guests ... his departed ancestors ... the devatas ... the king ... refreshing & nourishing his body, would do what is unrighteous, what is discordant; or one who, for the sake of refreshing & nourishing his body, would do what is righteous, what is concordant?"
    },
    {
      "tag": "p",
      "text": "\"Master Sariputta, the one who, for the sake of refreshing & nourishing his body, would do what is unrighteous, what is discordant, is not the better one. The one who, for the sake of refreshing & nourishing his body, would do what is righteous, what is concordant would be the better one there. Righteous behavior, concordant behavior, is better than unrighteous behavior, discordant behavior.[3]"
    },
    {
      "tag": "p",
      "text": " \"Dhanañjanin, there are other activities — reasonable, righteous — by which one can refresh & nourish one's body, and at the same time both not do evil and practice the practice of merit.\""
    },
    {
      "tag": "p",
      "text": "Then Dhanañjanin the brahman, delighting & rejoicing in Ven. Sariputta's words, got up from his seat and left."
    },
    {
      "tag": "p",
      "text": "Then on a later occasion, Dhanañjanin the brahman became diseased, in pain, severely ill. So he said to one of his men, \"Come, my good man. Go to the Blessed One and, on arrival, pay homage to his feet with your head in my name and say 'Lord, Dhanañjanin the brahman is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.' Then go to Ven. Sariputta and, on arrival, pay homage to his feet with your head in my name and say 'Venerable sir, Dhanañjanin the brahman is diseased, in pain, severely ill. He pays homage with his head to Ven. Sariputta's feet.' Then say, 'It would be good if Ven. Sariputta would visit Dhanañjanin's home, out of sympathy for him.'\""
    },
    {
      "tag": "p",
      "text": "Responding, \"As you say, lord,\" to Dhanañjanin the brahman, the man went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there he said, \"Lord, Dhanañjanin the brahman is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.\" Then he went to Ven. Sariputta and, on arrival, bowed down to him and sat to one side. As he was sitting there he said, 'Venerable sir, Dhanañjanin the brahman is diseased, in pain, severely ill. He pays homage with his head to Ven. Sariputta's feet.\" Then he said, \"It would be good if Ven. Sariputta would visit Dhanañjanin's home, out of sympathy for him.\" Ven. Sariputta acquiesced through silence."
    },
    {
      "tag": "p",
      "text": "Then Ven. Sariputta, having put on his robes and, taking his bowl & outer robe, went to Dhanañjanin's home. On arrival, he sat down on a prepared seat and said to him, \"I trust you are getting better, Dhanañjanin? I trust you are comfortable? I trust that your pains are lessening and not increasing? I trust that there are signs of their lessening, and not of their increasing?\""
    },
    {
      "tag": "p",
      "text": "\"I am not getting better, Master Sariputta. I am not comfortable. My severe pains are increasing, not lessening. There are signs of their increasing, and not of their lessening. Extreme forces slice through my head, just as if a strong man were slicing my head open with a sharp sword... Extreme pains have arisen in my head, just as if a strong man were tightening a turban on my head with a tough leather strap... Extreme forces carve up my stomach cavity, just as if an expert butcher or his apprentice were to carve up the stomach cavity of an ox with a sharp butcher's knife... There is an extreme burning in my body, just as if two strong men, seizing a weaker man with their arms, were to roast and broil him over a pit of hot embers. I am not getting better, venerable sir. I am not comfortable. My severe pains are increasing, not lessening. There are signs of their increasing, and not of their lessening.\""
    },
    {
      "tag": "p",
      "text": "\"What do you think, Dhanañjanin? Which is better: hell or the animal womb?\""
    },
    {
      "tag": "p",
      "text": "\"The animal womb is better than hell, Master Sariputta.\""
    },
    {
      "tag": "p",
      "text": "\"... Which is better: the animal womb or the realm of the hungry shades?\""
    },
    {
      "tag": "p",
      "text": "\"... the realm of the hungry shades...\""
    },
    {
      "tag": "p",
      "text": "\"... the realm of the hungry shades or human beings?\""
    },
    {
      "tag": "p",
      "text": "\"... human beings...\""
    },
    {
      "tag": "p",
      "text": "\"...human beings or the Four Great King devas?\""
    },
    {
      "tag": "p",
      "text": "\"...the Four Great King devas...\""
    },
    {
      "tag": "p",
      "text": "\"...the Four Great King devas or the devas of the Thirty-three?\""
    },
    {
      "tag": "p",
      "text": "\"...the devas of the Thirty-three...\""
    },
    {
      "tag": "p",
      "text": "\"...the devas of the Thirty-three or the Yama devas?\""
    },
    {
      "tag": "p",
      "text": "\"...the Yama devas...\""
    },
    {
      "tag": "p",
      "text": "\"...the Yama devas or the Tusita devas?\""
    },
    {
      "tag": "p",
      "text": "\"...the Tusita devas...\""
    },
    {
      "tag": "p",
      "text": "\"...the Tusita devas or the Nimmanarati devas?\""
    },
    {
      "tag": "p",
      "text": "\"...the Nimmanarati devas...\""
    },
    {
      "tag": "p",
      "text": "\"...the Nimmanarati devas or the Paranimmitavasavatti devas?\""
    },
    {
      "tag": "p",
      "text": "\"...the Paranimmitavasavatti devas...\""
    },
    {
      "tag": "p",
      "text": "\"...the Paranimmitavasavatti devas or the Brahma world?\""
    },
    {
      "tag": "p",
      "text": "\"Did Master Sariputta say, 'Brahma world'? Did Master Sariputta say, 'Brahma world'?\""
    },
    {
      "tag": "p",
      "text": "Then the thought occurred to Ven. Sariputta, \"These brahmans are set on the Brahma world. What if I were to teach Dhanañjanin the brahman the path to union with the Brahmas?\""
    },
    {
      "tag": "p",
      "text": "[So he said:] \"Dhanañjanin, I will teach you the path to union with the Brahmas. Listen and pay careful attention to that. I will speak.\""
    },
    {
      "tag": "p",
      "text": "\"As you say, master,\" Dhanañjanin the brahman responded to Ven. Sariputta."
    },
    {
      "tag": "p",
      "text": "Ven. Sariputta said: \"And what is the path to union with the Brahmas? There is the case where a monk keeps pervading the first direction [the east] with an awareness imbued with good will, likewise the second, likewise the third, likewise the fourth. Thus above, below, & all around, everywhere, in its entirety, he keeps pervading the all-encompassing cosmos with an awareness imbued with good will — abundant, expansive, immeasurable, without hostility, without ill will. He keeps pervading the first direction with an awareness imbued with compassion ... appreciation ... equanimity, likewise the second, likewise the third, likewise the fourth. Thus above, below, & all around, everywhere, in its entirety, he keeps pervading the all-encompassing cosmos with an awareness imbued with equanimity — abundant, expansive, immeasurable, without hostility, without ill will. This, Dhanañjanin, is the path to union with the Brahmas.\""
    },
    {
      "tag": "p",
      "text": "\"In that case, Master Sariputta, pay homage to the Blessed One's feet with your head in my name and say 'Lord, Dhanañjanin the brahman is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.'\""
    },
    {
      "tag": "p",
      "text": "So Ven. Sariputta — when there was still more to be done, having established Dhanañjanin the brahman in the inferior[4] Brahma world — got up from his seat and left. Then, not long after Ven. Sariputta's departure, Dhanañjanin the brahman died and reappeared in the Brahma world."
    },
    {
      "tag": "p",
      "text": "And the Blessed One said to the monks, \"Monks, Sariputta — when there was still more to be done, having established Dhanañjanin the brahman in the inferior Brahma world — has gotten up from his seat and left.\""
    },
    {
      "tag": "p",
      "text": "Then Ven. Sariputta went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"Lord, Dhanañjanin the brahman is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.\""
    },
    {
      "tag": "p",
      "text": "\"But why, Sariputta — when there was still more to be done, having established Dhanañjanin the brahman in the inferior Brahma world — did you get up from your seat and leave?\""
    },
    {
      "tag": "p",
      "text": "\"The thought occurred to me, lord, 'These brahmans are set on the Brahma worlds. What if I were to teach Dhanañjanin the brahman the path to union with the Brahmas?'\""
    },
    {
      "tag": "p",
      "text": "\"Sariputta, Dhanañjanin the brahman has died and reappeared in the Brahma world.\""
    },
    {
      "tag": "h1",
      "text": "Notes"
    },
    {
      "tag": "dl",
      "text": "\n1.\nThe PTS edition of the canon gives this name as Dhaanañjaani, whereas the Thai and Sri Lankan editions give it as Dhanañjaani. This discourse is unusual in that Ven. Sariputta addresses Dhanañjanin not as \"householder,\" but by his personal name. This would seem to indicate that the two of them were on especially familiar terms.\n2, 3.\nThis sentence appears in the Thai and Sri Lankan editions of the canon, and in MLS, but not in MLDB.\n4.\nI.e., inferior to any of the noble attainments. The Brahma world can be attained simply through the power of concentration applied to unlimited good will, etc., or to any of the jhanas. Only if discernment is developed to overcome passion and delight for these mundane attainments can the noble attainments be realized. For discussions of this issue see MN 106, AN 4.123-126, and AN 4.178.\n"
    },
    {
      "tag": "p",
      "text": "See also: MN 143; SN 3.17; SN 41.7; SN 41.10; AN 4.178; AN 10.15"
    }
  ]
}