{
  "author": "Thanissaro Bhikkhu",
  "preface_lines": [],
  "chapter_lines": [
    {
      "tag": "p",
      "text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. And at that time in King Pasenadi's realm there was a bandit named Angulimala: brutal, bloody-handed, devoted to killing & slaying, showing no mercy to living beings. He turned villages into non-villages, towns into non-towns, settled countryside into unsettled countryside. Having repeatedly killed human beings, he wore a garland (mala) made of fingers (anguli)."
    },
    {
      "tag": "p",
      "text": "Then the Blessed One, early in the morning, having put on his robes and carrying his outer robe & bowl, went into Savatthi for alms. Having wandered for alms in Savatthi and returning from his alms round after his meal, he set his lodging in order. Carrying his robes & bowl, he went along the road to where Angulimala was staying. Cowherds, shepherds, & farmers saw him going along the road to where Angulimala was staying, and on seeing him said to him, \"Don't go along that road, contemplative, for on that road is Angulimala: brutal, bloody-handed, devoted to killing & slaying, showing no mercy to living beings. He has turned villages into non-villages, towns into non-towns, settled countryside into unsettled countryside. Having repeatedly killed human beings, he wears a garland made of fingers. Groups of ten, twenty, thirty, & forty men have gone along that road, and even they have fallen into Angulimala's hands.\" When this was said, the Blessed One kept going in silence."
    },
    {
      "tag": "p",
      "text": "A second time... A third time, cowherds, shepherds, & farmers said to the Blessed One, \"Don't go along that road, contemplative... Groups of ten, twenty, thirty, & forty men have gone along that road, and even they have fallen into Angulimala's hands.\" When this was said, the Blessed One kept going in silence."
    },
    {
      "tag": "p",
      "text": "Then Angulimala saw the Blessed One coming from afar and on seeing him, this thought occurred to him: \"Isn't it amazing! Isn't it astounding! Groups of ten, twenty, thirty, & forty men have gone along this road, and even they have fallen into my hands, and yet now this contemplative comes attacking, as it were, alone and without a companion. Why don't I kill him?\" So Angulimala, taking up his sword & shield, buckling on his bow & quiver, followed right behind the Blessed One."
    },
    {
      "tag": "p",
      "text": "Then the Blessed One willed a feat of psychic power such that Angulimala, though running with all his might, could not catch up with the Blessed One walking at normal pace. Then the thought occurred to Angulimala: \"Isn't it amazing! Isn't it astounding! In the past I've chased & seized even a swift-running elephant, a swift-running horse, a swift-running chariot, a swift-running deer. But now, even though I'm running with all my might, I can't catch up with this contemplative walking at normal pace.\" So he stopped and called out to the Blessed One, \"Stop, contemplative! Stop!\""
    },
    {
      "tag": "p",
      "text": "\"I have stopped, Angulimala. You stop.\""
    },
    {
      "tag": "p",
      "text": "Then the thought occurred to Angulimala, \"These Sakyan contemplatives are speakers of the truth, asserters of the truths, and yet this contemplative, even while walking, says, 'I have stopped, Angulimala. You stop.' Why don't I question him?\""
    },
    {
      "tag": "p",
      "text": "So Angulimala the bandit addressed this verse to the Blessed One:"
    },
    {
      "tag": "string",
      "text": "\n\"While walking, contemplative,\nyou say, 'I have stopped.'\nBut when "
    },
    {
      "tag": "i",
      "text": "I"
    },
    {
      "tag": "string",
      "text": " have stopped\nyou say I haven't.\nI ask you the meaning of this:\nHow have you stopped?\nHow haven't I?\"\n\n"
    },
    {
      "tag": "p",
      "text": "[The Buddha:]"
    },
    {
      "tag": "string",
      "text": "\n\"I have stopped, Angulimala,\nonce & for all,\nhaving cast off violence\ntoward all living beings.\nYou, though,\nare unrestrained toward beings.\nThat's how I've stopped\nand you haven't.\"\n\n"
    },
    {
      "tag": "p",
      "text": "[Angulimala:]"
    },
    {
      "tag": "string",
      "text": "\n\"At long last a greatly revered great seer\n\tfor my sake\nhas come to the great forest.\nHaving heard your verse\nin line with the Dhamma,\nI will go about\nhaving abandoned evil.\"\n\nSo saying, the bandit\nhurled his sword & weapons\n\tover a cliff\n\tinto a chasm,\n\t   a pit.\nThen the bandit paid homage\nto the feet of the One Well-gone,\nand right there requested the Going-forth.\n\nThe Awakened One,\nthe compassionate great seer,\nthe teacher of the world, along with its devas,\nsaid to him then:\n\t\"Come, bhikkhu.\"\nThat in itself\nwas bhikkhuhood for him.\n"
    },
    {
      "tag": "p",
      "text": "Then the Blessed One set out wandering toward Savatthi with Ven. Angulimala as his attendant monk. After wandering by stages he reached Savatthi, and there he lived, near Savatthi, in Jeta's Grove, Anathapindika's monastery."
    },
    {
      "tag": "p",
      "text": "Now at that time a large crowd of people, loud & noisy, had gathered at the gates to King Pasenadi Kosala's inner palace, [calling out,] \"There is a bandit in your realm, sire, named Angulimala: brutal, bloody-handed, devoted to killing & slaying, showing no mercy to living beings. He has turned villages into non-villages, towns into non-towns, settled countryside into unsettled countryside. Having repeatedly killed human beings, he wears a garland made of fingers. The king must stamp him out!\""
    },
    {
      "tag": "p",
      "text": "Then King Pasenadi Kosala, with a cavalry of roughly 500 horsemen, drove out of Savatthi and entered the monastery. Driving as far as the ground was passable for chariots, he got down from his chariot and went on foot to the Blessed One. On arrival, having bowed down, he sat to one side. As he was sitting there, the Blessed One said to him, \"What is it, great king? Has King Seniya Bimbisara of Magadha provoked you, or have the Licchavis of Vesali or some other hostile king?\""
    },
    {
      "tag": "p",
      "text": "\"No, lord. King Seniya Bimbisara of Magadha hasn't provoked me, nor have the Licchavis of Vesali, nor has some other hostile king. There is a bandit in my realm, lord, named Angulimala: brutal, bloody-handed, devoted to killing & slaying, showing no mercy to living beings. He has turned villages into non-villages, towns into non-towns, settled countryside into unsettled countryside. Having repeatedly killed human beings, he wears a garland made of fingers. I am going to stamp him out.\" [1]"
    },
    {
      "tag": "p",
      "text": "\"Great king, suppose you were to see Angulimala with his hair & beard shaved off, wearing the ochre robe, having gone forth from the home life into homelessness, refraining from killing living beings, refraining from taking what is not given, refraining from telling lies, living the holy life on one meal a day, virtuous & of fine character: what would you do to him?\""
    },
    {
      "tag": "p",
      "text": "\"We would bow down to him, lord, or rise up to greet him, or offer him a seat, or offer him robes, almsfood, lodgings, or medicinal requisites for curing illness; or we would arrange a lawful guard, protection, & defense. But how could there be such virtue & restraint in an unvirtuous, evil character?\""
    },
    {
      "tag": "p",
      "text": "Now at that time Ven. Angulimala was sitting not far from the Blessed One. So the Blessed One, pointing with his right arm, said to King Pasenadi Kosala, \"That, great king, is Angulimala.\" Then King Pasenadi Kosala was frightened, terrified, his hair standing on end. So the Blessed One, sensing the king's fear & hair-raising awe, said to him, \"Don't be afraid, great king. Don't be afraid. He poses no danger to you.\""
    },
    {
      "tag": "p",
      "text": "Then the king's fear, his terror, his hair-standing-on-end subsided. He went over to Ven. Angulimala and said, \"Are you really Angulimala, lord?\""
    },
    {
      "tag": "p",
      "text": "\"Yes, great king.\""
    },
    {
      "tag": "p",
      "text": "\"What is your father's clan? What is your mother's clan?\""
    },
    {
      "tag": "p",
      "text": "\"My father is a Gagga, great king, and my mother a Mantani.\""
    },
    {
      "tag": "p",
      "text": "\"Then may Master Gagga Mantaniputta delight [in staying here]. I will be responsible for your robes, almsfood, lodgings, & medicinal requisites for curing illness.\""
    },
    {
      "tag": "p",
      "text": "Now it so happened that at that time Ven. Angulimala was a wilderness-dweller, an alms-goer, wearing one set of the triple robe made of cast-off cloth. So he said to King Pasenadi Kosala, \"Enough, great king. My triple robe is complete.\""
    },
    {
      "tag": "p",
      "text": "So King Pasenadi Kosala went to the Blessed One and on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One, \"It's amazing, lord. It's astounding, how the Blessed One has tamed the untamed, pacified the unpeaceful, and brought to Unbinding those who were not unbound. For what we could not tame even with blunt or bladed weapons, the Blessed One has tamed without blunt or bladed weapons. Now, lord, we must go. Many are our duties, many our responsibilities.\""
    },
    {
      "tag": "p",
      "text": "\"Then do, great king, what you think it is now time to do.\""
    },
    {
      "tag": "p",
      "text": "Then King Pasenadi Kosala got up from his seat, bowed down to the Blessed One and — keeping him to his right — departed."
    },
    {
      "tag": "p",
      "text": "Then Ven. Angulimala, early in the morning, having put on his robes and carrying his outer robe & bowl, went into Savatthi for alms. As he was going from house to house for alms, he saw a woman suffering a breech birth. On seeing her, the thought occurred to him: \"How tormented are living beings! How tormented are living beings!\" Then, having wandered for alms in Savatthi and returning from his alms round after his meal, he went to the Blessed One. On arrival, having bowed down to him, he sat to one side. As he was sitting there he said to the Blessed One, \"Just now, lord, early in the morning, having put on my robes and carrying my outer robe & bowl, I went into Savatthi for alms. As I was going from house to house for alms, I saw a woman suffering a breech birth. On seeing her, the thought occurred to me: 'How tormented are living beings! How tormented are living beings!'\""
    },
    {
      "tag": "p",
      "text": "\"In that case, Angulimala, go to that woman and on arrival say to her, 'Sister, since I was born I do not recall intentionally killing a living being. Through this truth may there be wellbeing for you, wellbeing for your fetus.'\""
    },
    {
      "tag": "p",
      "text": "\"But, lord, wouldn't that be a lie for me? For I have intentionally killed many living beings.\""
    },
    {
      "tag": "p",
      "text": "\"Then in that case, Angulimala, go to that woman and on arrival say to her, 'Sister, since I was born in the noble birth, I do not recall intentionally killing a living being. Through this truth may there be wellbeing for you, wellbeing for your fetus.'\"[2]"
    },
    {
      "tag": "p",
      "text": "Responding, \"As you say, lord,\" to the Blessed One, Angulimala went to that woman and on arrival said to her, \"Sister, since I was born in the noble birth, I do not recall intentionally killing a living being. Through this may there be wellbeing for you, wellbeing for your fetus.\" And there was wellbeing for the woman, wellbeing for her fetus."
    },
    {
      "tag": "p",
      "text": "Then Ven. Angulimala, dwelling alone, secluded, heedful, ardent, & resolute, in no long time reached & remained in the supreme goal of the holy life for which clansmen rightly go forth from home into homelessness, knowing & realizing it for himself in the here & now. He knew: \"Birth is ended, the holy life fulfilled, the task done. There is nothing further for the sake of this world.\" And thus Ven. Angulimala became another one of the arahants."
    },
    {
      "tag": "p",
      "text": "Then Ven. Angulimala, early in the morning, having put on his robes and carrying his outer robe & bowl, went into Savatthi for alms. Now at that time a clod thrown by one person hit Ven. Angulimala on the body, a stone thrown by another person hit him on the body, and a potsherd thrown by still another person hit him on the body. So Ven. Angulimala — his head broken open and dripping with blood, his bowl broken, and his outer robe ripped to shreds — went to the Blessed One. The Blessed One saw him coming from afar and on seeing him said to him: \"Bear with it, brahman! Bear with it! The fruit of the kamma that would have burned you in hell for many years, many hundreds of years, many thousands of years, you are now experiencing in the here-&-now!\" [3]"
    },
    {
      "tag": "p",
      "text": "Then Ven. Angulimala, having gone alone into seclusion, experienced the bliss of release. At that time he exclaimed:"
    },
    {
      "tag": "string",
      "text": "\nWho once was heedless,"
    },
    {
      "tag": "a",
      "text": "[4]"
    },
    {
      "tag": "string",
      "text": " \nbut later is not,\n\tbrightens the world\n\tlike the moon set free from a cloud.\n\nHis evil-done deed"
    },
    {
      "tag": "a",
      "text": "[5]"
    },
    {
      "tag": "string",
      "text": " \nis replaced with skillfulness:\n\the brightens the world\n\tlike the moon set free from a cloud.\n\nWhatever young monk\ndevotes himself\nto the Buddha's bidding:\n\the brightens the world\n\tlike the moon set free from a cloud.\n\nMay even my enemies\n\thear talk of the Dhamma.\nMay even my enemies\n\tdevote themselves\n\tto the Buddha's bidding.\nMay even my enemies\n\tassociate with those people\n\twho — peaceful, good —\n\tget others to accept the Dhamma.\nMay even my enemies\n\thear the Dhamma time & again\n\tfrom those who advise  endurance,\n\t               forbearance,\n\twho praise non-opposition,\nand may they follow it.\n\nFor surely he wouldn't harm me,\nor anyone else;\nhe would attain     the foremost peace,\nwould protect   the feeble & firm.\n\nIrrigators guide   the water."
    },
    {
      "tag": "a",
      "text": "[6]"
    },
    {
      "tag": "string",
      "text": " \nFletchers shape     the arrow shaft.\nCarpenters shape    the wood.\nThe wise control\n\t       themselves.\n\nSome tame with a blunt stick,\nwith hooks, & with whips\nBut without blunt or bladed weapons\nI was tamed by the one who is Such.\n\n\"Doer of No Harm\" is my name,\nbut I used to be a doer of harm.\nToday I am true to my name,\nfor I harm no one at all.\n\n   A bandit\n\tI used to be,\nrenowned as Angulimala.\nSwept along by a great flood,\nI went to the Buddha as refuge.\n\n   Bloody-handed\n\tI used to be,\nrenowned as Angulimala.\nSee my going for refuge!\nUprooted is [craving],\nthe guide to becoming.\n\nHaving done the type of kamma\nthat would lead to many\nbad destinations,\ntouched by the fruit of [that] kamma,\nunindebted, I eat my food. "
    },
    {
      "tag": "a",
      "text": "[7]"
    },
    {
      "tag": "string",
      "text": " \n\nThey're addicted to heedlessness"
    },
    {
      "tag": "a",
      "text": "[8]"
    },
    {
      "tag": "string",
      "text": " \n — dullards, fools —\nwhile one who is wise\ncherishes heedfulness\nas his highest wealth.\n\nDon't give way to heedlessness"
    },
    {
      "tag": "a",
      "text": "[9]"
    },
    {
      "tag": "string",
      "text": " \n\tor to intimacy\n\twith sensual delight —\nfor a heedful person,\nabsorbed in jhana,\nattains an abundant bliss.\n\nThis"
    },
    {
      "tag": "a",
      "text": "[10]"
    },
    {
      "tag": "string",
      "text": " has come well & not gone away,\nit was not badly thought through for me.\nFrom among well-analyzed qualities,\n\tI have obtained\n\tthe best.\n\nThis has come well & not gone away,\nit was not badly thought through for me.\n\tThe three knowledges\n\thave been attained;\n\tthe Buddha's bidding,\n\t       done.\n"
    },
    {
      "tag": "h1",
      "text": "Notes"
    },
    {
      "tag": "dl",
      "text": "\n1.\nThe PTS reading here, followed in The Middle Length Sayings and The Middle Length Discourses of the Buddha — \"I will not stamp him out\" — is surely a mistake. I follow the Thai reading on this passage, even though it is somewhat ungrammatical. There are passages in MN 90 where King Pasenadi's sentences don't quite parse, and perhaps this is another example of his brusque language.\n2.\nThis blessing is often chanted at house blessings in Theravada countries.\n3.\nThis incident illustrates the kammic principle stated in AN 3.99.\n4.\nThis verse = Dhp 172.\n5.\nThis verse = Dhp 173.\n6.\nThis verse = Dhp 80.\n7.\nThis verse is another illustration of the principle stated in AN 3.99.\n8.\nThis verse = Dhp 26.\n9.\nThis verse = Dhp 27.\n10.\n\"This\" apparently refers to the abundant bliss mentioned in the previous verse.\n"
    }
  ]
}