{
  "author": "Nyanaponika Thera",
  "preface_lines": [],
  "chapter_lines": [
    {
      "tag": "p",
      "text": "1. Thus have I heard. Once the Blessed One was staying at Savatthi, in Jeta's Grove, Anathapindika's monastery."
    },
    {
      "tag": "p",
      "text": "2. Then one evening the venerable Maha-Cunda[1] rose from meditative seclusion and went to the Blessed One. Having paid homage to him, he sat down at one side and spoke thus to the Blessed One:"
    },
    {
      "tag": "p",
      "text": "3. \"Venerable sir, there are these various views that arise in the world concerning self-doctrines or world-doctrines.[2] Does the abandoning and discarding of such views come about in a monk who is only at the beginning of his [meditative] reflections?\"[3]"
    },
    {
      "tag": "p",
      "text": "\"Cunda, as to those several views that arise in the world concerning self-doctrines and world-doctrines, if [the object] in which[4] these views arise, in which they underlie and become active,[5] is seen with right wisdom[6] as it actually is,[7] thus: 'This is not mine,[8] this I am not,[9] this is not my self'[10] — then the abandoning of these views, their discarding,[11] takes place in him [who thus sees]."
    },
    {
      "tag": "h2",
      "text": "The Eight Attainments"
    },
    {
      "tag": "p",
      "text": "4. \"It may be, Cunda, that some monk, detached from sense-objects, detached from unsalutary ideas, enters into the first absorption that is born of detachment, accompanied by thought-conception and discursive thinking, and filled with rapture and joy, and he then might think: 'I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble One's discipline they are called 'abidings in ease here and now.'[12]"
    },
    {
      "tag": "p",
      "text": "5. \"It may be that after the stilling of thought conception and discursive thinking, he gains the inner tranquillity and harmony of the second absorption that is free of thought-conception and discursive thinking, born of concentration and filled with rapture and joy; and he then might think: 'I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble One's discipline they are called 'abidings in ease here and now.'"
    },
    {
      "tag": "p",
      "text": "6. \"It may be that after the fading away of rapture, the monk dwells in equanimity, mindful and clearly aware, and he experiences a happiness in his body of which the Noble Ones say: 'Happily lives he who dwells in equanimity and is mindful!' — that third absorption he wins; and he then might think: 'I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble One's discipline they are called 'abidings in ease here and now.'"
    },
    {
      "tag": "p",
      "text": "7. \"It may be that with the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, he enters upon and abides in the fourth absorption, which is beyond pleasure and pain and has purity of mindfulness due to equanimity; and he then might think: 'I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble One's discipline they are called 'abidings in ease here and now.'"
    },
    {
      "tag": "p",
      "text": "8. \"It may be that, with the entire transcending of perceptions of corporeality,[13] with the disappearance of perceptions of sense-response,'[14] with non-attention to perceptions of variety,[15] thinking: 'Space is infinite,' some monk enters upon and abides in the sphere of infinite space; and he then might think: 'I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble One's discipline they are called 'peaceful abidings.'"
    },
    {
      "tag": "p",
      "text": "9. \"It may be that by entirely transcending the sphere of infinite space, thinking: 'Consciousness is infinite,' some monk enters and abides in the sphere of infinite consciousness; and he then might think: 'I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble One's discipline they are called 'peaceful abidings.'"
    },
    {
      "tag": "p",
      "text": "10. \"It may be that by entirely transcending the sphere of infinite consciousness, some monk enters and abides in the sphere of nothingness; and he then might think: I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble One's discipline they are called 'peaceful abidings.'"
    },
    {
      "tag": "p",
      "text": "11. \"It may be that, by entirely transcending the sphere of nothingness, some monk enters and abides in the sphere of neither-perception-nor-non-perception; and he then might think: 'I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble one's discipline they are called 'peaceful abidings.'"
    },
    {
      "tag": "h2",
      "text": "Effacement"
    },
    {
      "tag": "p",
      "text": "12. \"But herein, Cunda, effacement should be practiced by you:[16]"
    },
    {
      "tag": "ul",
      "text": "\n(1) Others will be harmful; we shall not be harmful here — thus effacement can be done.[17]\n(2) Others will kill living beings; we shall abstain from killing living beings here — thus effacement can be done.\n(3) Others will take what is not given; we shall abstain from taking what is not given here — thus effacement can be done.\n(4) Others will be unchaste; we shall be chaste here — thus effacement can be done.\n(5) Others will speak falsehood; we shall abstain from false speech here — thus effacement can be done.\n(6) Others will speak maliciously; we shall abstain from malicious speech here — thus effacement can be done.\n(7) Others will speak harshly; we shall abstain from harsh speech here — thus effacement can be done.\n(8) Others will gossip; we shall abstain from gossip here — thus effacement can be done.\n(9) Others will be covetous; we shall not be covetous here — thus effacement can be done.\n(10) Others will have thoughts of ill will; we shall not have thoughts of ill will here — thus effacement can be done.\n(11) Others will have wrong views; we shall have right view here — thus effacement can be done.\n(12) Others will have wrong intention; we shall have right intention here — thus effacement can be done.\n(13) Others will use wrong speech; we shall use right speech here — thus effacement can be done.\n(14) Others will commit wrong actions; we shall do right actions here — thus effacement can be done.\n(15) Others will have wrong livelihood; we shall have right livelihood here — thus effacement can be done.\n(16) Others will make wrong effort; we shall make right effort here — thus effacement can be done.\n(17) Others will have wrong mindfulness; we shall have right mindfulness here — thus effacement can be done.\n(18) Others will have wrong concentration; we shall have right concentration here — thus effacement can be done.\n(19) Others will have wrong knowledge; we shall have right knowledge here — thus effacement can be done.\n(20) Others will have wrong deliverance; we shall have right deliverance here — thus effacement can be done.\n(21) Others will be overcome by sloth and torpor; we shall be free from sloth and torpor here — thus effacement can be done.\n(22) Others will be agitated; we shall be unagitated here — thus effacement can be done.\n(23) Others will be doubting; we shall be free from doubt here — thus effacement can be done.\n(24) Others will be angry; we shall not be angry here — thus effacement can be done.\n(25) Others will be hostile; we shall not be hostile here — thus effacement can be done.\n(26) Others will denigrate; we shall not denigrate here — thus effacement can be done.\n(27) Others will be domineering; we shall not be domineering here — thus effacement can be done.\n(28) Others will be envious; we shall not be envious here — thus effacement can be done.\n(29) Others will be jealous; we shall not be jealous here — thus effacement can be done.\n(30) Others will be fraudulent; we shall not be fraudulent here — thus effacement can be done.\n(31) Others will be hypocrites; we shall not be hypocrites here — thus effacement can be done.\n(32) Others will be obstinate; we shall not be obstinate here — thus effacement can be done.\n(33) Others will be arrogant; we shall not be arrogant here — thus effacement can be done.\n(34) Others will be difficult to admonish; we shall be easy to admonish here — thus effacement can be done.\n(35) Others will have bad friends; we shall have noble friends here — thus effacement can be done.\n(36) Others will be negligent; we shall be heedful here — thus effacement can be done.\n(37) Others will be faithless; we shall be faithful here — thus effacement can be done.\n(38) Others will be shameless; we shall be shameful here — thus effacement can be done.\n(39) Others will be without conscience; we shall have conscience here — thus effacement can be done.\n(40) Others will have no learning; we shall be learned here — thus effacement can be done.\n(41) Others will be idle; we shall be energetic here — thus effacement can be done.\n(42) Others will be lacking in mindfulness; we shall be established in mindfulness here — thus effacement can be done.\n(43) Others will be without wisdom; we shall be endowed with wisdom — thus effacement can be done.\n(44) Others will misapprehend according to their individual views, hold on to them tenaciously and not easily discard them;[18] we shall not misapprehend according to individual views nor hold on to them tenaciously, but shall discard them with ease — thus effacement can be done.\n"
    },
    {
      "tag": "h2",
      "text": "The Arising of Thought"
    },
    {
      "tag": "p",
      "text": "13. \"Cunda, I say that even the arising of a thought concerned with salutary things [and ideas][19] is of great importance, not to speak of bodily acts and words conforming [to such thought].[20] Therefore, Cunda:"
    },
    {
      "tag": "ul",
      "text": "\n(1) The thought should be produced: 'Others will be harmful; we shall not be harmful here.'\n(2) The thought should be produced: 'Others will kill living beings; we shall abstain from killing living beings here.'\n(3)-(43)...\n(44) The thought should be produced: 'Others will misapprehend according to their individual views, hold on to them tenaciously and not easily discard them; we shall not misapprehend according to individual views nor hold on to them tenaciously, but shall discard them with ease.'\n"
    },
    {
      "tag": "h2",
      "text": "Avoidance"
    },
    {
      "tag": "p",
      "text": "14. \"Suppose, Cunda, there were an uneven road and another even road by which to avoid it; and suppose there were an uneven ford and another even ford by which to avoid it.[21] So too:"
    },
    {
      "tag": "ul",
      "text": "\n(1) A person given to harmfulness has non-harming by which to avoid it.\n(2) A person given to killing living beings has abstention from killing by which to avoid it.\n(3) A person given to taking what is not given has abstention from taking what is not given by which to avoid it.\n(4) A person given to unchastity has chastity by which to avoid it.\n(5) A person given to false speech has abstention from false speech by which to avoid it.\n(6) A person given to malicious speech has abstention from malicious speech by which to avoid it.\n(7) A person given to harsh speech has abstention from harsh speech by which to avoid it.\n(8) A person given to gossip has abstention from gossip by which to avoid it.\n(9) A person given to covetousness has non-covetousness by which to avoid it.\n(10) A person given to thoughts of ill will has non-ill will by which to avoid it.\n(11) A person given to wrong view has right view by which to avoid it.\n(12) A person given to wrong intention has right intention by which to avoid it.\n(13) A person given to wrong speech has right speech by which to avoid it.\n(14) A person given to wrong action has right action by which to avoid it.\n(15) A person given to wrong livelihood has right livelihood by which to avoid it.\n(16) A person given to wrong effort has right effort by which to avoid it.\n(17) A person given to wrong mindfulness has right mindfulness by which to avoid it.\n(18) A person given to wrong concentration has right concentration by which to avoid it.\n(19) A person given to wrong knowledge has right knowledge by which to avoid it.\n(20) A person given to wrong deliverance has right deliverance by which to avoid it.\n(21) A person overcome by sloth and torpor has freedom from sloth and torpor by which to avoid it.\n(22) A person given to agitation has non-agitation by which to avoid it.\n(23) A person given to doubting has freedom from doubt by which to avoid it.\n(24) A person given to anger has freedom from anger by which to avoid it.\n(25) A person given to hostility has freedom from hostility by which to avoid it.\n(26) A person given to denigrating has non-denigrating by which to avoid it.\n(27) A person given to domineering has non-domineering by which to avoid it.\n(28) A person given to envy has non-envy by which to avoid it.\n(29) A person given to jealousy has non-jealousy by which to avoid it.\n(30) A person given to fraud has non-fraud by which to avoid it.\n(31) A person given to hypocrisy has non-hypocrisy by which to avoid it.\n(32) A person given to obstinacy has non-obstinacy by which to avoid it.\n(33) A person given to arrogance has non-arrogance by which to avoid it.\n(34) A person difficult to admonish has amenability by which to avoid it.\n(35) A person given to making bad friends has making good friends by which to avoid it.\n(36) A person given to negligence has heedfulness by which to avoid it.\n(37) A person given to faithlessness has faith by which to avoid it.\n(38) A person given to shamelessness has shame by which to avoid it.\n(39) A person without conscience has conscience by which to avoid it.\n(40) A person without learning has acquisition of great learning by which to avoid it.\n(41) A person given to idleness has energetic endeavor by which to avoid it.\n(42) A person without mindfulness has the establishment of mindfulness by which to avoid it.\n(43) A person without wisdom has wisdom by which to avoid it.\n(44) A person given to misapprehending according to his individual views, to holding on to them tenaciously and not discarding them easily, has non-misapprehension of individual views, non-holding on tenaciously and ease in discarding by which to avoid it.\n"
    },
    {
      "tag": "h2",
      "text": "The Way Upward"
    },
    {
      "tag": "p",
      "text": "15. \"Cunda, as all unsalutary states lead downward and all salutary states lead upward, even so, Cunda:"
    },
    {
      "tag": "ul",
      "text": "\n(1) A person given to harmfulness has harmlessness to lead him upward.[22]\n(2) A person given to killing living beings has abstention from killing to lead him upwards.\n(3)-(43)...\n(44) A person given to misapprehending according to his individual views, to holding on to them tenaciously and not discarding them easily, has non-misapprehension of individual views, non-holding on tenaciously and ease in discarding to lead him upward.\n"
    },
    {
      "tag": "h2",
      "text": "Quenching"
    },
    {
      "tag": "p",
      "text": "16. \"Cunda, it is impossible that one who is himself sunk in the mire[23] should pull out another who is sunk in the mire. But it is possible, Cunda, that one not sunk in the mire himself should pull out another who is sunk in the mire."
    },
    {
      "tag": "p",
      "text": "\"It is not possible, Cunda, that one who is himself not restrained, not disciplined and not quenched [as to his passions],[24] should make others restrained and disciplined, should make them attain to the full quenching [of passions].[25] But it is possible, Cunda, that one who is himself restrained, disciplined and fully quenched [as to his passions] should make others restrained and disciplined, should make them attain to the full quenching [of passions]. Even so, Cunda:[26]"
    },
    {
      "tag": "ul",
      "text": "\n(1) A person given to harmfulness has harmlessness by which to attain to the full quenching [of it].\n(2) A person given to killing living beings has abstention from killing by which to attain to the full quenching [of it].\n(3)-(43)...\n(44) A person given to misapprehending according to his individual views, to holding on to them tenaciously and not discarding them easily, has non-misapprehension of individual views, non-holding on tenaciously and ease in discarding by which to attain the quenching [of them].\n"
    },
    {
      "tag": "h2",
      "text": "Conclusion"
    },
    {
      "tag": "p",
      "text": "17. \"Thus, Cunda, I have shown to you the instruction on effacement, I have shown to you the instruction on thought's arising, I have shown to you the instruction on avoidance, I have shown to you the instruction on the way upward, I have shown to you the instruction on quenching."
    },
    {
      "tag": "p",
      "text": "18. \"What can be done for his disciples by a Master who seeks their welfare and has compassion and pity on them, that I have done for you, Cunda.[27] There are these roots of trees, there are empty places. Meditate, Cunda, do not delay, lest you later regret it. 'This is my message to you.\""
    },
    {
      "tag": "p",
      "text": "Thus spoke the Blessed One. Satisfied, the venerable Cunda rejoiced in the Blessed One's words."
    },
    {
      "tag": "p",
      "text": "[The concluding verse added by the 'Theras of the First Council:]"
    },
    {
      "tag": "string",
      "text": "\nDeep like the ocean is this Suttanta on Effacement,\nDealing with forty-four items,\nshowing them in five sections.\n"
    }
  ]
}