{
  "author": "Piyadassi Thera",
  "preface_lines": [],
  "chapter_lines": [
    {
      "tag": "p",
      "text": "Thus have I heard:"
    },
    {
      "tag": "p",
      "text": "On one occasion the Blessed One was living on Isigili mountain near Rajagaha. Then he addressed the monks saying, \"O monks.\" \"Bhante (Venerable Sir),\" replied those monks in assent to the Blessed One. Thereupon he said this:"
    },
    {
      "tag": "p",
      "text": "\"Do you, monks, see this Vebhara mountain?\""
    },
    {
      "tag": "p",
      "text": "\"Yes, bhante.\""
    },
    {
      "tag": "p",
      "text": "\"There was another name, monks, for this Vebhara mountain, another designation. Do you, monks, see this Pandava mountain?\""
    },
    {
      "tag": "p",
      "text": "\"Yes, bhante.\""
    },
    {
      "tag": "p",
      "text": "\"There was another name, monks, for this Pandava mountain, another designation. Do you, monks, see this Vepulla mountain?\""
    },
    {
      "tag": "p",
      "text": "\"Yes, bhante.\""
    },
    {
      "tag": "p",
      "text": "\"There was another name, monks, for this Vepulla mountain, another designation. Do you, monks, see this Gijjhakuta mountain?\""
    },
    {
      "tag": "p",
      "text": "\"Yes, bhante.\""
    },
    {
      "tag": "p",
      "text": "\"There was another name, monks, for this Gijjhakuta mountain, another designation. Do you, monks, see this Isigili mountain?\""
    },
    {
      "tag": "p",
      "text": "\"Yes, bhante.\""
    },
    {
      "tag": "p",
      "text": "\"This has been the very name, monks, the very designation for this Isigili mountain. In the past, monks, five hundred paccekabuddhas[1] lived for a long time on this Isigili mountain. As they were entering the mountain they were visible, but once they have entered, they were invisible. People seeing this remarked: 'This mountain swallows these seers (isigilati)'; hence the name Isigili came into being."
    },
    {
      "tag": "p",
      "text": "\"I will tell you, monks, the names of the paccekabuddhas. I will reveal, monks, the names of the paccekabuddhas. Listen, pay close attention, I will speak.\""
    },
    {
      "tag": "p",
      "text": "\"Yes, bhante,\" replied the monks."
    },
    {
      "tag": "p",
      "text": "The blessed One said:"
    },
    {
      "tag": "p",
      "text": "\"Arittha,[2] monks, was a paccekabuddha who lived for a long time on this Isigili mountain, Uparittha... Tagarasikhi... Yasassi... Sudassana... Piyadassi... Gandhara... Pindola... Upasabha... Nitha... Tatha... Sutava... Bhavitatta, monks, was a paccekabuddha who lived for a long time on this Isigili mountain."
    },
    {
      "tag": "p",
      "text": "i. \"The names of those supreme beings[3] who are free from sorrow and desire, who have overcome their passions,[4] and have individually attained enlightenment, noble among men. I make known. Listen to me:"
    },
    {
      "tag": "p",
      "text": "ii. \"Arittha, Uparittha, Tagarasikhi, Yasassi, Sudassana, Piyadassi the enlightened.[5] Gandhara, Pindola and Upasabha, Nitha, Tatha, Sutava, Bhavitatta."
    },
    {
      "tag": "p",
      "text": "iii. \"Sumbha, Subha, Methula, Atthama, and then Megha, Anigha, Sudatha are paccekabuddhas whose desire for becoming (re-living) is destroyed. Hingu and Hinga of great power."
    },
    {
      "tag": "p",
      "text": "iv. \"The two sages Jali[6] and Atthaka, then Kosala, the enlightened one, then Subahu, Upanemisa, Nemisa, Santacitta, Sacca, Tatha, Viraja, and Pandita."
    },
    {
      "tag": "p",
      "text": "v. \"Kala, Upakala, Vijita and Jita, Anga and Panga and Gutijjita. Passi removed defilements, the root of suffering. Aparajita, conqueror of Mara's might."
    },
    {
      "tag": "p",
      "text": "vi. \"Sattha, Pavatta, Sarabhanga, Lomahamsa, Uccangamaya, Asita, Anasava. Manomaya and Bandhuma, the destroyers of pride; Tadadhimutta, Vimala, and Ketuma."
    },
    {
      "tag": "p",
      "text": "vii. \"Ketumbaraga and Matanga, Ariya. Then Accuta and Accutagamabyamaka. Sumangala, Dabbila, Suppatitthita, Asayha, Khemabhirata, and Sorata."
    },
    {
      "tag": "p",
      "text": "viii. \"Durannaya, Sangha, and Uccaya, and then the sage Sayha of sublime energy. Ananda, Nanda, Upananda, the twelve paccekabuddhas,[7] Bharadvaja bearing his last body.[8]"
    },
    {
      "tag": "p",
      "text": "ix. \"Bodhi, Mahanama, and then Uttara; Kesi, Sikhi, Sundara, and Bharadvaja. Tissa, Upatissa, Upasidari, the destroyer of the bonds of becoming, and Sidari, the destroyer of craving."
    },
    {
      "tag": "p",
      "text": "x. \"Mangala was the lust-free paccekabuddha, Usabha who cut away the ensnaring root of suffering. Upanita who attained state of Calm (Nibbana), Uposatha, Sundara, and Saccanama."
    },
    {
      "tag": "p",
      "text": "xi. \"Jeta, Jayanta, Paduma, and Uppala; Padumuttara, Rakkhita, and Pabbata. Manatthaddha, Sobhita, Vataraga, and the paccekabuddha Kanha well freed in mind."
    },
    {
      "tag": "p",
      "text": "xii. \"These and others are paccekabuddhas of great power whose desires for becoming (re-living) are destroyed. Do salute these great sages of immeasurable (virtue) who have gone beyond all attachment[9] and attained Parinibbana.\""
    },
    {
      "tag": "h1",
      "text": "Notes"
    },
    {
      "tag": "dl",
      "text": "\n1.\nThey are Buddhas, who have attained enlightenment independent of another's aid, but lack the faculty of convincing others.\n2.\nFor stories connected with these thirteen names see Dictionary of Pali Proper Names, G. P. Malalasekera.\n3.\nLiterally those essences of beings, MA. iv. 129. Having declared the names of these thirteen paccekabuddhas, the names of those others who are the essences of beings, are now revealed in verse.\n4.\nLiterally removed the spike of passions (visalla).\n5.\nIt would appear that the reason why in the Pali stanzas attributes are mentioned in respect of some paccekabuddhas, and not all, is for metrical purposes.\n6.\nCulla Jali and Maha Jali.\n7.\nFour Anandas, four Nandas and four Upanandas, MA., iv. 129.\n8.\nThe five aggregates of: body; feelings or sensations; perceptions; formations and consciousness.\n9.\nSangha, attachment or grasping, they are: lust, hate, delusion, pride, and false views.\n"
    }
  ]
}